---
title: BalusterPlacement
classe: Autodesk.Revit.DB.Architecture.BalusterPlacement
namespace: Autodesk.Revit.DB.Architecture
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# BalusterPlacement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BalusterPattern BalusterPattern { get; }` | `balusterPlacement.BalusterPattern` | BalusterPattern |
| `ElementId BalusterPerTreadFamilyId { get; set; }` | `balusterPlacement.BalusterPerTreadFamilyId` | ElementId |
| `Int32 BalusterPerTreadNumber { get; set; }` | `balusterPlacement.BalusterPerTreadNumber` | Int32 |
| `Boolean IsValidObject { get; }` | `balusterPlacement.IsValidObject` | Boolean |
| `PostPattern PostPattern { get; }` | `balusterPlacement.PostPattern` | PostPattern |
| `Boolean UseBalusterPerTreadOnStairs { get; set; }` | `balusterPlacement.UseBalusterPerTreadOnStairs` | Boolean |
| `Void Dispose()` | `balusterPlacement.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```